Tekla Open API Reference for Tekla Structures 2025
ModelObjectSelector.GetAllObjectsWithType Method
Overload List
Name | Description
GetAllObjectsWithType(Type[])
 Returns an enumerator of all the model objects in the current model with the given base type.
GetAllObjectsWithType(ModelObject.ModelObjectEnum)
 Returns an enumerator of all the model objects in the current model with the given type.
Top
See Also
Reference
ModelObjectSelector Class
Tekla.Structures.Model Namespace